app/controllers/api/concepts_controller.rb

  def index
    @concepts = Concept.all.includes(:images)
---
SELECT "concepts".* FROM "concepts"

  def create
    @concept = Concept.new(concept_params)
    @concept.user_id = current_user.id

    if @concept.save
---
INSERT INTO "concepts" ("title", "description", "user_id", "created_at", "updated_at", "image_url", "video_url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @concept = Concept.find(params[:id])
---
SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def destroy
    @concept = Concept.find(params[:id])
    @concept.destroy
---
SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "concepts" WHERE "concepts"."id" = $1  [["id", 7]]

  def update
    @concept = Concept.find(params[:id])
    if @concept.update(concept_params)
---
SELECT  "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "concepts" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "concepts"."id" = $4  [["title", "Testing5.1"], ["description", "testing5.1testing5.1"], ["updated_at", 2017-02-15 22:41:25 UTC], ["id", 7]]